Repository: anup810/Greetings
Catalog: Greetings/Localizable.xcstrings
Source language: en
Languages: fr

source: Accessibility & VoiceOver Support
fr: Accessibilité & support VoiceOve

source: Animations with SwiftUI & UIKit
fr: Animations avec SwiftUI & UIKit

source: App Storage & UserDefaults
fr: Stockage des applications & UserDefaults

source: Are you ready to
fr: Êtes-vous prêt ?

source: Building Apps for watchOS, macOS, & tvOS
fr: Création d'applications pour watchOS, macOS et tvOS

source: Building Augmented Reality with ARKit
fr: Création de réalité augmentée avec ARKit

source: Building Custom UI Components
fr: Création de composants d'interface utilisateur personnalisés

source: Click on text and disc
fr: Cliquez sur le texte et le disque

source: Concurrency with async/await & Grand Central Dispatch (GCD)
fr: Concurrence avec async/await & Grand Central Dispatch (GCD)

source: Core Data and SwiftData
fr: Core Data et SwiftData

source: Core Motion & Sensors (Gyroscope, Accelerometer)
fr: Capteurs Core Motion (Gyroscope, Accéléromètre)

source: Debugging with Xcode Instruments & Console Logs
fr: Débogage avec Xcode Instruments & Console Logs

source: English
fr: Anglaise

source: Exploring iOS Programming
fr: Exploration de la programmation iOS

source: French
fr: Français

source: Greetings
fr: Salutations

source: Handling User Input & Forms
fr: Gestion de l'entrée utilisateur et des formulaires

source: HealthKit & Fitness Tracking
fr: Suivi de la condition physique avec HealthKit

source: Hello there!
fr: Bonjour !

source: Integrating In-App Purchases & StoreKit
fr: Intégration des achats intégrés & StoreKit

source: Integrating REST APIs & GraphQL
fr: Intégration des API REST & GraphQL

source: Location Services & MapKit
fr: Services de localisation & MapKit

source: Machine Learning with CoreML & Vision
fr: Apprentissage automatique avec CoreML & Vision

source: Managing State with State, Binding, and Environment
fr: Gestion de l'état avec State, Binding et Environment

source: Navigation with SwiftUI NavigationStack & UIKit UINavigationController
fr: Navigation avec SwiftUI NavigationStack & UIKit UINavigationController

source: Networking with URLSession & Alamofire
fr: Mise en réseau avec URLSession & Alamofire

source: Publishing Apps to the App Store
fr: Publication d'applications sur l'App Store

source: Push Notifications & Local Notifications
fr: Notifications push et notifications locales

source: Security & Keychain Services
fr: Sécurité & services Keychain

source: Start exploring?
fr: Commencer à explorer ?

source: Swift Programming Language
fr: Langage de programmation Swift

source: Text will be randomly generated and observe nice animations!
fr: Le texte sera généré aléatoirement et observera de belles animations !

source: Unit Testing & UI Testing with XCTest
fr: Tests unitaires et tests UI avec XCTest

source: Using Auto Layout and SwiftUI Layout System
fr: Utilisation de l'Auto Layout et du système de disposition SwiftUI

source: Using Combine Framework for Reactive Programming
fr: Utilisation du framework Combine pour la programmation réactive

source: Using WidgetKit for Home Screen Widgets
fr: Utilisation de WidgetKit pour les widgets de l'écran d'accueil

source: Version Control with Git & GitHub
fr: Contrôle de version avec Git & GitHub

source: Welcome to Swift Programming
fr: Bienvenue dans la programmation Swift
